       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD2NUMS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  A      PIC 9 VALUE 2.
       01  B      PIC 9 VALUE 3.
       01  RESULT PIC 99.
       PROCEDURE DIVISION.
           ADD A B GIVING RESULT.
           DISPLAY RESULT.
           STOP RUN.